2mem/redeploy/ab_full_log.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.457 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.19 [#/sec] (mean)
Time per request:       457.451 [ms] (mean)
Time per request:       457.451 [ms] (mean, across all concurrent requests)
Transfer rate:          0.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      227  227   0.0    227     227
Processing:   230  230   0.0    230     230
Waiting:      230  230   0.0    230     230
Total:        457  457   0.0    457     457
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.480 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    2.09 [#/sec] (mean)
Time per request:       479.607 [ms] (mean)
Time per request:       479.607 [ms] (mean, across all concurrent requests)
Transfer rate:          0.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      238  238   0.0    238     238
Processing:   242  242   0.0    242     242
Waiting:      238  238   0.0    238     238
Total:        480  480   0.0    480     480
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      1
Time taken for tests:   0.545 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      259 bytes
HTML transferred:       61 bytes
Requests per second:    1.83 [#/sec] (mean)
Time per request:       545.232 [ms] (mean)
Time per request:       545.232 [ms] (mean, across all concurrent requests)
Transfer rate:          0.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      269  269   0.0    269     269
Processing:   277  277   0.0    277     277
Waiting:      277  277   0.0    277     277
Total:        545  545   0.0    545     545
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.522 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.92 [#/sec] (mean)
Time per request:       2552.195 [ms] (mean)
Time per request:       255.219 [ms] (mean, across all concurrent requests)
Transfer rate:          0.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      218  250  12.1    249     303
Processing:   249 2148 401.9   2263    2459
Waiting:      239 1465 611.5   1513    2318
Total:        493 2398 402.4   2520    2696

Percentage of the requests served within a certain time (ms)
  50%   2520
  66%   2535
  75%   2542
  80%   2544
  90%   2553
  95%   2569
  98%   2584
  99%   2696
 100%   2696 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.405 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      25900 bytes
HTML transferred:       6100 bytes
Requests per second:    3.94 [#/sec] (mean)
Time per request:       2540.520 [ms] (mean)
Time per request:       254.052 [ms] (mean, across all concurrent requests)
Transfer rate:          1.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      216  249  13.4    249     287
Processing:   237 2126 406.0   2234    2605
Waiting:      231 1228 648.0   1242    2287
Total:        466 2375 409.1   2482    2874

Percentage of the requests served within a certain time (ms)
  50%   2482
  66%   2502
  75%   2524
  80%   2528
  90%   2551
  95%   2568
  98%   2579
  99%   2874
 100%   2874 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com (be patient).....done


Server Software:        Werkzeug/3.1.3
Server Hostname:        fargate-benchmark-alb-ov3-110705629.us-east-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /fib
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   25.350 seconds
Complete requests:      100
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      25903 bytes
HTML transferred:       6103 bytes
Requests per second:    3.94 [#/sec] (mean)
Time per request:       2534.968 [ms] (mean)
Time per request:       253.497 [ms] (mean, across all concurrent requests)
Transfer rate:          1.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      224  248  24.7    244     437
Processing:   242 2129 408.7   2190    2657
Waiting:      240 1620 535.8   1696    2585
Total:        495 2377 410.7   2435    2912

Percentage of the requests served within a certain time (ms)
  50%   2435
  66%   2468
  75%   2487
  80%   2496
  90%   2707
  95%   2753
  98%   2900
  99%   2912
 100%   2912 (longest request)